Public Attributes | List of all members
API_RailingToprailQuantity Struct Reference
Element Manager API
Calculated values for a top rail. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
The volume of the top rail.
double  | length3D
The 3D length of the top rail.
Detailed Description
Calculated values for a top rail.
Member Data Documentation
◆ length3D
 API_RailingToprailQuantity::length3D
The 3D length of the top rail.
◆ volume
 API_RailingToprailQuantity::volume
The volume of the top rail.